import styles from './blog.module.css'
import BlogPage from '@/components/blog_page/blogPage'
export default function Blog(){
    const dataBlog=[
        {
            id: 1,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 2,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 3,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 4,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 5,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 6,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 7,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 8,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 9,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },
        {
            id: 10,
            title: 'سلام دنیا!',
            desc: 'به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!',
        },

    ]
    return(
        ///bug

        // dir : rtl
        // back_color
        //tran_button
        //import_image
        <div className='' style={{backgroundColor : 'var(--backgroundColor)'}}> 
            <div className={styles.img_background}>
                <div className='flex justify-center items-center h-full'>
                    <h2 className='text-white text-7xl font-bold'>صفحه وبلاگ</h2>
                </div>
            </div>
            {dataBlog.map((item) => (
                <BlogPage key={item.id} {...item} />
            ))}
        </div>
    )
}